Autodesk.Revit.DB.WorksetConfiguration.Close(System.Collections.Generic.IList`1{Autodesk.Revit.DB.WorksetId})
Sets a group of user-created worksets to close.
Remarks:
Calling this method on a configuration created with options other than WorksetConfigurationOption.CloseAllWorksets will set these
worksets to be explicitly closed.  If all worksets are set to close, the configuration will be unchanged.  Worksets other than the inputs are unaffected.
worksetsToClose:
The group of user-created worksets to close.  Non-user-created worksets and invalid workset ids will be ignored.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.WorksetConfiguration.Open(System.Collections.Generic.IList`1{Autodesk.Revit.DB.WorksetId})
Sets a group of user-created worksets to open.
Remarks:
Calling this method on a configuration created with options other than WorksetConfigurationOption.OpenAllWorksets will set these
worksets to be explicitly opened.  If all worksets are set to open, the configuration will be unchanged.  Worksets other than the inputs are unaffected.
worksetsToOpen:
The group of user-created worksets to open.  Non-user-created worksets and invalid workset ids will be ignored.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.WorksetConfiguration.OpenLastViewed
Sets the configuration to open all user-created worksets that were last recorded to be open;
other worksets are not affected.
Remarks:
Calling this method on a configuration created with WorksetConfigurationOption.CloseAllWorksets will change the configuration
to close all worksets except for the last viewed. Otherwise, this has no effect.
Since:
2014

Autodesk.Revit.DB.WorksetConfiguration.CloseAll
Sets the configuration to close user-created worksets by default.
Remarks:
Calling this method on a configuration created with WorksetConfigurationOption.OpenAllWorksets will change the configuration
to close all worksets.  Otherwise, this has no effect.
Since:
2014